In [ ]:
DataFrame : 

1- Dictionary

2- list

3- Series

4- NdArray

In [1]:
import pandas as pd

In [2]:
# list

lst = [2,4,6,8,10]

df = pd.DataFrame(lst)
df

    0
0   2
1   4
2   6
3   8
4  10

In [12]:
lst = [2,4,6,8,10]

df = pd.DataFrame(lst,columns=["Even_Numbers"],index=[1001,1002,1003,1004,1005])
df

      Even_Numbers
1001             2
1002             4
1003             6
1004             8
1005            10

In [14]:
# Series 

lst = [2,4,6,8,10]

s = pd.Series(lst)
df = pd.DataFrame(s)
df

    0
0   2
1   4
2   6
3   8
4  10

In [15]:
# Ndarray

import numpy as np

In [22]:
data = np.array([[2,4,6],[2,4,6],[2,4,6]])
df = pd.DataFrame(data,columns=["first","second","third"])
df

   first  second  third
0      2       4      6
1      2       4      6
2      2       4      6

In [34]:
# reading csv file

read_csv_file = pd.read_csv(r"C:\Users\jitud\21-July\pandas\data.csv")
read_csv_file

     Name  Age Location
0    John   22    Delhi
1     Bob   25   Mumbai
2  Vikram   28     Pune
3    John   31    Delhi
4     Bob   34   Mumbai
5  Vikram   37     Pune
6    John   40    Delhi
7     Bob   43   Mumbai
8  Vikram   46     Pune

In [37]:
len(read_csv_file)

9

In [38]:
# type
type(read_csv_file)

pandas.core.frame.DataFrame

In [40]:
# read top five dataframe records
read_csv_file.head()

     Name  Age Location
0    John   22    Delhi
1     Bob   25   Mumbai
2  Vikram   28     Pune
3    John   31    Delhi
4     Bob   34   Mumbai

In [41]:
# read bottom five dataframe records
read_csv_file.tail()

     Name  Age Location
4     Bob   34   Mumbai
5  Vikram   37     Pune
6    John   40    Delhi
7     Bob   43   Mumbai
8  Vikram   46     Pune

In [42]:
# to get the infomation about the dataframe
read_csv_file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      9 non-null      object
 1   Age       9 non-null      int64
 2   Location  9 non-null      object
dtypes: int64(1), object(2)
memory usage: 348.0+ bytes

In [43]:
# to get the statstical information ablout dataframe

read_csv_file.describe()

             Age
count   9.000000
mean   34.000000
std     8.215838
min    22.000000
25%    28.000000
50%    34.000000
75%    40.000000
max    46.000000

In [48]:
# check the dataframe empty or not
if read_csv_file.empty:
    print("no records found")
else:
    print("records found")

records found

In [50]:
# df is null or not?

read_csv_file.isnull().sum()

Name        0
Age         0
Location    0
dtype: int64

In [51]:
read_csv_file.rename(columns={"Name":"Names"},inplace=True)

In [52]:
read_csv_file

    Names  Age Location
0    John   22    Delhi
1     Bob   25   Mumbai
2  Vikram   28     Pune
3    John   31    Delhi
4     Bob   34   Mumbai
5  Vikram   37     Pune
6    John   40    Delhi
7     Bob   43   Mumbai
8  Vikram   46     Pune

In [54]:
# dataframe to dict

print(read_csv_file.to_dict())

{'Names': {0: 'John', 1: 'Bob', 2: 'Vikram', 3: 'John', 4: 'Bob', 5: 'Vikram', 6: 'John', 7: 'Bob', 8: 'Vikram'}, 'Age': {0: 22, 1: 25, 2: 28, 3: 31, 4: 34, 5: 37, 6: 40, 7: 43, 8: 46}, 'Location': {0: 'Delhi', 1: 'Mumbai', 2: 'Pune', 3: 'Delhi', 4: 'Mumbai', 5: 'Pune', 6: 'Delhi', 7: 'Mumbai', 8: 'Pune'}}

In [55]:
# drop the null value
read_csv_file.dropna()

    Names  Age Location
0    John   22    Delhi
1     Bob   25   Mumbai
2  Vikram   28     Pune
3    John   31    Delhi
4     Bob   34   Mumbai
5  Vikram   37     Pune
6    John   40    Delhi
7     Bob   43   Mumbai
8  Vikram   46     Pune

In [56]:
# drop the column from dataframe
read_csv_file.drop(columns="Location")

    Names  Age
0    John   22
1     Bob   25
2  Vikram   28
3    John   31
4     Bob   34
5  Vikram   37
6    John   40
7     Bob   43
8  Vikram   46

In [62]:
# add new row in dataframe

read_csv_file.loc[len(read_csv_file)] = ["Pritam",20,"Nashik"]

In [63]:
read_csv_file

     Names   Age Location
0     John  22.0    Delhi
1      Bob  25.0   Mumbai
2   Vikram  28.0     Pune
3     John  31.0    Delhi
4      Bob  34.0   Mumbai
5   Vikram  37.0     Pune
6     John  40.0    Delhi
7      Bob  43.0   Mumbai
8   Vikram  46.0     Pune
9      NaN   NaN      NaN
10  Pritam  20.0   Nashik

In [65]:
read_csv_file.isna().sum()

Names       1
Age         1
Location    1
dtype: int64

In [72]:
read_csv_file.iloc[0]

Names        John
Age          22.0
Location    Delhi
Name: 0, dtype: object

In [70]:
read_csv_file.loc[0,"Names"]

'John'

In [73]:
# to get the column name
read_csv_file["Names"]

0       John
1        Bob
2     Vikram
3       John
4        Bob
5     Vikram
6       John
7        Bob
8     Vikram
9        NaN
10    Pritam
Name: Names, dtype: object

In [75]:
# to get the column name
read_csv_file.get("Names")

0       John
1        Bob
2     Vikram
3       John
4        Bob
5     Vikram
6       John
7        Bob
8     Vikram
9        NaN
10    Pritam
Name: Names, dtype: object

In [77]:
!pip install openpyxl # this package for excel read

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [79]:
# read excel data

df = pd.read_excel("location_details.xlsx")
df

      John   22   Delhi
0     Name  Age     Loc
1      Bob   25  Mumbai
2   Vikram   28    Pune
3     John   31   Delhi
4      Bob   34  Mumbai
5   Vikram   37    Pune
6     John   40   Delhi
7      Bob   43  Mumbai
8   Vikram   46    Pune
9      NaN  NaN     NaN
10  Pritam   20  Nashik